<meta charset="utf-8">
<?php // data page ?>
<?php
  $class = array();
  $class[1][1] = array(
    array(1, "프로젝트길라잡이II", "교양", 1, "산415"),
  );
  $class[1][2] = array(
    array(2, "디지털신호처리", "김현태", 2, "산417"),
    array(3, "데이터베이스", "우영운", 2, "산415"),
  );
  $class[1][3] = array(
    array(1, "생애및진로설계", "교양", 1, "정보109,110"),
  );
  $class[1][4] = array(
    array(2, "데이터구조", "이광의", 1, "산415"),
    array(20213032, "데이터구조", "이광의", 1, "산학415"),
  );
  $class[1][5] = array(
    array(1, "이산수학", "김형석", 2, "산415"),
    array(3, "컴퓨터네트워크", "김남규", 2, "산417"),
  );
  $class[1][6] = array(
    array(2, "파이썬", "장경식", 1, "산419"),
    array(20213032, "파이썬", "장경식", 1, "산학419"),
  );
  $class[1][7] = array(
    array(0, "창업가(?)", "교양", 2, ""),
    array(20213032, "콜라보체험활동", "천정미", 2, "2인508"),
    
  );
  $class[1][8] = "";
  $class[1][9] = "";

  $class[2][1] = "";
  $class[2][2] = array(
    array(1, "영어회화", "교양", 2, "정보210,931,914"),
//    array(3, "비주얼컴퓨팅", "김형석", 1, ""),
  );
  $class[2][3] = array(
    array(2, "딥러닝기초", "김형석", 1, "산417"),
    array(3, "컴퓨터비전", "장경식", 1, "산419"),
    array(20213032, "딥러닝기초", "김형석", 1, "산학417"),
  );
  $class[2][4] = "";
  $class[2][5] = array(
    array(1, "이산수학", "김형석", 1, "산415"),
    array(2, "웹서버", "이광의", 1, "산417"),
    array(3, "컴퓨터네트워크", "김남규", 1, "산419"),
    array(20213032, "웹서버", "이광의", 1, "산학417"),
  );
  $class[2][6] = array(
    array(5, "학과장회의", "학과장", 1, ""), // 학과장=우영운
    array(2, "컴퓨터구조", "김현태", 2, "산417"),
    array(0, "뷰프로(?)", "교양", 2, ""),
    array(20213032, "컴퓨터구조", "김현태", 2, "산학415"),
  );
  $class[2][7] = array(
    array(6, "학과회의", "학과교수", 1, "산410"),
  );
  $class[2][8] = array(
    array(1, "지도교수멘토링", "", 1, ""),
    array(2, "지도교수멘토링", "", 1, ""),
    array(3, "지도교수멘토링", "", 1, ""),
    array(4, "지도교수멘토링", "", 1, ""),
    array(20213032, "지도교수멘토링IV", "장경식", 1, "산학411"),
  );
  $class[2][9] = "";

  $class[3][1] = array(
    array(2, "파이썬", "장경식", 2, "산417"),
    array(3, "비주얼컴퓨팅", "김형석", 2, "산411"),
    array(20213032, "파이썬", "장경식", 2, "산학417"),
  );
  $class[3][2] = array(
    array(1, "컴퓨터프로그래밍II002", "우영운", 1, "산410"),
  );
  $class[3][3] = array(
    array(2, "디지털신호처리", "김현태", 1, "산417"),
  );
  $class[3][4] = array(
    array(1, "컴퓨터프로그래밍II001", "우영운", 1, "산419"),
  );
  $class[3][5] = array(
    array(2, "딥러닝기초", "김형석", 2, "산417"),
    array(3, "캡스톤디자인I", "김현태", 1, "산415"),
    array(20213032, "딥러닝기초", "김형석", 2, "산학417"),
  );
  $class[3][6] = array(
    array(3, "데이터베이스", "우영운", 1, "산415"),
  );
  $class[3][7] = "";
  $class[3][8] = "";
  $class[3][9] = "";

  $class[4][1] = array(
    array(3, "캡스톤디자인I", "김현태", 2, "산415"),
  );
  $class[4][2] = array(
    array(1, "디지털시대와인문학", "교양", 2, "정보109,110"),
  );
  $class[4][3] = array(
    array(2, "컴퓨터구조", "김현태", 1, "산417"),
    array(3, "비주얼컴퓨팅", "김형석", 1, "산415"),
    array(20213032, "컴퓨터구조", "김현태", 1, "산학415"),
  );
  $class[4][4] = "";
  $class[4][5] = array(
    array(2, "웹서버001", "이광의", 2, "산410"),
    array(3, "운영체제", "김남규", 1, "산419"),
  );
  $class[4][6] = array(
    array(3, "컴퓨터비전", "장경식", 2, "산417"),
  );
  $class[4][7] = array(
    array(2, "웹서버002", "이광의", 2, "산419"),
    array(20213032, "웹서버002", "이광의", 2, "산학419"),
  );
  $class[4][8] = "";
  $class[4][9] = "";

  $class[5][1] = array(
    array(3, "운영체제", "김남규", 2, "산417"),
  );
  $class[5][2] = array(
    array(4, "딥러닝", "외부", 3, "산411"),
  );
  $class[5][3] = array(
    array(1, "컴퓨터프로그래밍II001", "우영운", 2, "산419"),
  );
  $class[5][4] = "";
  $class[5][5] = array(
    array(1, "컴퓨터프로그래밍II002", "우영운", 1, "산410"),
    array(2, "데이터구조", "이광의", 2, "산415"),
    array(20213032, "데이터구조", "이광의", 2, "산학415"),
  );
  $class[5][6] = array(
    array(4, "소프트웨어공학", "김남규", 3, "산417"),
  );
  $class[5][7] = "";
  $class[5][8] = "";
  $class[5][9] = "";